/**
 * 1. 숫자 맞추기 게임
 * 2. 1부터 10까지의 숫자 중 하나를 하나 입력받는다.
 * 3. 컴퓨터는 1부터 10까지의 숫자 중 하나를 랜덤으로 생성한다.
 * 4. 사용자가 입력한 숫자와 컴퓨터가 생성한 숫자가 같으면 "정답!"을 출력한다.
 * 5. 입력한 숫자가 컴퓨터가 생성한 숫자보다 작으면 "더 큰 숫자입니다 다시 시도해 주세요"를 출력한다.
 * 6. 입력한 숫자가 컴퓨터가 생성한 숫자보다 크면 "더 작은 숫자입니다 다시 시도해 주세요"를 출력한다.
 * 7. 정답을 맞출 때까지 2~6의 과정을 반복한다.
 * 
 * 힌트=> Math.random() 함수를 사용하여 1부터 10까지의 숫자를 생성한다.
 * 창을 띄우기 위해서는 alert() 함수를 사용한다.
 */



// 컴퓨터가 생각하는 숫자
let correctNumber;
// 사용자 입력을 받을 변수 초기화
let userGuess = 0;

// while문안에 조건문 넣기
while () {
  userGuess = Number(prompt("1부터 10 사이의 숫자를 맞춰보세요: "));
  // 위 코드는 건들지 마세요👆

  // 아래 코드를 입력해 주세요👇



}